{"version":"https://jsonfeed.org/version/1","title":"Jenny Fung","home_page_url":"http://localhost/","feed_url":"http://localhost/feed.json","description":"Here, I blog and share some creative work. Posts are tagged for organization and filtering but are otherwise the gang's all here.","items":[{"id":"http://localhost/posts/wn-55-clothing/","url":"http://localhost/posts/wn-55-clothing/","title":"Way out (Writing Night)","content_html":"<blockquote>\n<p>Prompt: Write a 55 word story about clothing</p>\n</blockquote>\n<h3 id=\"way-out\" tabindex=\"-1\"><a href=\"http://localhost/posts/wn-55-clothing/#way-out\" class=\"header-anchor\">Way out</a></h3>\n<p>She shook her pouch like a maraca and adjusted her coat. Crunch. Warm and dry. She rigged it from thread, tape, and space blankets littered after the city’s marathon last month. The garment looked silly but soon produced local envy and the start of a little business. Jingle. These coins would be her way out.</p>\n<hr>\n<p>Every month my writing group convenes for 90 minutes. 30 mins of shooting the breeze, 30 mins of creative writing, and 30 minutes of sharing. This is the result.</p>\n","date_published":"Wed, 19 Jun 2024 00:00:00 GMT"},{"id":"http://localhost/posts/three-noises/","url":"http://localhost/posts/three-noises/","title":"3 Noises","content_html":"<blockquote>\n<p>Prompt: Write a story that includes 3 sounds I hear around me</p>\n</blockquote>\n<p><em>Kkkkk...kkk...kkk...</em> 2 weeks away. Week over week, the familiar static had become a pavlov's bell for a little snooze as she lay heavy and horizontal. Today, though, sleep was chased just out of reach by a spike of anxiety.</p>\n<p>&quot;Aww. Look at her little toes.&quot; Sure enough, all 5 on each foot: a relief for her dark imagination. <em>Kkk...kkk...clang!</em> She flinched. The sticky wand just slipped from the doctor's hand onto the metal cart.</p>\n<p>&quot;Well, everything looks great Hannah. That's it. Your last checkup before delivery. If you have no further questions, I'll leave you to get dressed and wish you luck!&quot; After a few exchanged thanks, the door clicked close. Hannah and her forever companion together, alone.</p>\n<hr>\n<p>I wrote this short story on the back of a receipt in a bustling bar with a record player. It was inspired by an extended family member that was due any day.</p>\n","date_published":"Fri, 12 Apr 2024 00:00:00 GMT"},{"id":"http://localhost/posts/dancemeditation/","url":"http://localhost/posts/dancemeditation/","title":"A Dance Meditation","content_html":"<blockquote>\n<p>I wrote this poem for the Heritage Dance Project with Group Motion Dance Company in late 2020. At that time, as for many, I felt broken. My body, my identity, creativity, all felt so foreign to me. I struggled with the project's prompt to explore my heritage through dance, song, and text. Still, with encouragement, I forced myself to try. To attempt moving and expressing again, and see what happened. Within those awkward attempts, I found some simple truths I could write about honestly: how dancing/moving feels to me and how the process of doing improv dancing had wider wisdom and questions for me. 3 years later, I find the strong visuals in this text force me into breath and movement as I read it. I hope it can help you find the same.</p>\n</blockquote>\n<h3 id=\"a-dance-meditation\" tabindex=\"-1\"><a href=\"http://localhost/posts/dancemeditation/#a-dance-meditation\" class=\"header-anchor\">A Dance Meditation</a></h3>\n<p>When I shut off the mind voice,<br>\nthe devil,<br>\nthe angel on my shoulders,<br>\nthe worried idle prattle,<br>\nI breathe into my body.<br>\nFeel the cool air flow into my nasal cavity,<br>\nslide down and warm into my lungs.</p>\n<p>Breathe out.</p>\n<p>I picture the air radiate outward into my lowering shoulders,<!--more--><br>\nthrough my biceps,<br>\ndown my sinewy forearms,<br>\nand finally swirl into my fingertips.<br>\nMy wrists flick.<br>\nI am an empty cavity and playground for the breath's path,<br>\nfinding its way like slow pinball to my extremities.</p>\n<p>My body is moving with.<br>\nThe movement of air is energy,<br>\nand it is generous.<br>\nI breathe in slowly,<br>\nmy scapula sink<br>\ninto a stretch that it feels tense<br>\nbut welcome.<br>\nUntensing, I breathe again,<br>\nthe feet steeled to the ground,<br>\nand the knees find some bend.</p>\n<p>I am dancing.<br>\nA dance of listening and spontaneity.<br>\nOf no purpose.<br>\nNo agenda.<br>\nA slow dance that finds aches and tension in hiding and brings them an oxygenated massage.</p>\n<p>It costs only a willingness to be open,<br>\nlisten and respond.<br>\nTo hold discomfort.</p>\n<p>For in the process, the muscles will stretch and perhaps they will tear.<br>\nBut the body is built for this ritual.<br>\nIt will sew new strength between the muscle fibers,<br>\nbuilding new bends and new possibilities.<br>\nPrepare you for the next.</p>\n<p>How are you filtering out the noise and building your strength?<br>\nHow are you inviting discomfort and healing it?<br>\nHow are you listening?<br>\nHow will you respond?</p>\n<hr>\n<p>Thank you endlessly to my late and great dance mentor Manfred Fischbeck for seeing and encouraging the creativity in me, even from his hospital bed. This was/is by some magic a self-regenerating gift.</p>\n<hr>\n","date_published":"Wed, 20 Dec 2023 00:00:00 GMT"},{"id":"http://localhost/posts/wn-shapeshifter/","url":"http://localhost/posts/wn-shapeshifter/","title":"Kryptonite (Writing Night)","content_html":"<blockquote>\n<p>Prompt: Write about the kyptonite of the super power shapeshifting</p>\n</blockquote>\n<h3 id=\"transcript-from-a-super-powers-anonymous-meeting\" tabindex=\"-1\"><a href=\"http://localhost/posts/wn-shapeshifter/#transcript-from-a-super-powers-anonymous-meeting\" class=\"header-anchor\">Transcript from a Super Powers Anonymous meeting</a></h3>\n<p>&quot;Hello, my power is shape shifting, and I don’t know who I am.</p>\n<p>Everything was going fine enough until 2020. As of 2020, I can’t enter a chatroom without being asked to give a little speech about who I am – Greek, male, he/him, lactose intolerant, son of Zeus and Hera. The last part is true, but I could drink as much milk as you weigh if I turn into a baby elephant right now, and then I wouldn’t be Greek either. But really, every new social gathering I go to I’m asked to give a little bio of myself these days. And it feels like a lie, it feels like I’m constantly lying to everyone. My super power might be better said: pathological liar, founded in 2020. Good name for a speakeasy. I feel I am as much that baby elephant as a centaur as the son of Zeus. And I feel just as much that I am none of those things. I hate these chats. I eyeroll at giving these bios. I hate channeling myself into a few words that people are going to interpret wrongly anyway. Somedays I just want to be an asshole (not literally) and what am I going to introduce myself as, then? Can’t I be an asshole for a day and live in peace? It used to be fun and carefree, shape shifting. I could be spontaneous to suit the moment, shape shift from my joy or anger. But these new norms that ask me who I am at every turn…they have me feeling like a liar. I’m not a liar, not in most of my forms, and I don’t think of myself that way. I fundamentally don’t and can’t know who I am. I can be anything. But I can’t be who you want me to be, when you want it. Where among mortals can that be alright?&quot;</p>\n<hr>\n<p>Every month my writing group convenes for 90 minutes. 30 mins of shooting the breeze, 30 mins of creative writing, and 30 minutes of sharing. This is the result.</p>\n<hr>\n","date_published":"Wed, 01 Nov 2023 00:00:00 GMT"},{"id":"http://localhost/posts/echizen/","url":"http://localhost/posts/echizen/","title":"A Day Trip to the Ancient Crafts of Echizen","content_html":"<h3 id=\"tldr\" tabindex=\"-1\"><a href=\"http://localhost/posts/echizen/#tldr\" class=\"header-anchor\">TLDR</a></h3>\n<p>I visited Echizen, a small city in the Japan countryside, famous for a long history of crafts. Echizen has a unique, little-known, and growing tourism program. To help future English-speaking tourists, I made public resources that map program locations to Google Maps. Use and copy freely!</p>\n<!--more-->\n<p>The resources: <a href=\"https://docs.google.com/spreadsheets/d/1bwseI89bdvTZtk2KPPKXKxjBsOn9ghALF9pYd_FRg1I/edit#gid=0\">spreadsheet</a>, <a href=\"https://www.google.com/maps/d/viewer?mid=1TtgIZJi_dbll7fYMhSUZ7Km23wcaXK8&amp;ll=35.95575194228227%2C136.17386385000003&amp;z=12\">google map</a>.</p>\n<h3 id=\"off-the-beaten-path\" tabindex=\"-1\"><a href=\"http://localhost/posts/echizen/#off-the-beaten-path\" class=\"header-anchor\">Off the Beaten Path</a></h3>\n<p>I made pilgrimage to Eiheiji Temple, the great granddaddy temple of <a href=\"https://zmm.org/all-programs/\">Zen Mountain Monastary</a>, in Fukui Prefecture, Japan. To make the most of a trek into the countryside, I looked for nearby entertainment. Inspired by this <a href=\"https://www.japan-guide.com/ad/echizen-city/\">blog post</a>, I did a day-trip to the neighboring Echizen, an ancient crafts town. 1500 years ago (!), great quality water was discovered in Echizen and it became the home of many water-reliant crafts. Today, masters of pottery, knives, washi paper, soba noodles, and more are still active.</p>\n<p>As of 2023, Echizen has designed a unique tourism program that made traveling in an off-the-beaten-path rural area very accessible and inexpensive. It is still a work in progress, but I was impressed: it was clear, user-friendly, has a lot of potential for other rural towns who want to grow tourism.</p>\n<hr>\n<p>Note: I didn't take any photos and only thought of writing this after the fact.</p>\n<hr>\n<p>I did not organize my visit to Echizen well at all. There are many sights  sprinkled across a ~10 mile (~16km) radius. I didn't know where to go, or how to get there, until I showed up at the Echizen Tourism Office. On top of that, I don't speak any Japanese and only had 1/2 a day to explore because I missed an infrequent village bus (which had cascading effects on the schedule).</p>\n<p>Transportation around Echizen:</p>\n<ol>\n<li>Rent a car</li>\n<li>Rent a bicycle<br>\nBike rental is available through the tourist information center at Takefu Station. The <a href=\"https://www.guidoor.jp/en/places/17\">bikes</a> looked new and comfortable, but are more of a leisure bike than a sports bike. Echizen is pretty flat, so this is probably fine, and it would be a 20-40 ride between some main destinations, possibly longer. The roads would be mixed between rice fields and highways. Bike rental info is missing from Google Maps, and I didn't see other bike rental shops. You must have a form of identification to rent a bike.</li>\n<li><a href=\"https://www.echizen-tourism.jp/uploads/event/11_%E8%BF%8E%E8%BB%8A%E8%8B%B1%E8%AA%9E%E3%83%9E%E3%83%8B%E3%83%A5%E3%82%A2%E3%83%AB_0427.pdf\">500 yen taxi</a><br>\nThis program is so awesome. Echizen provides heavily subsidized taxi rides between any <a href=\"https://www.echizen-tourism.jp/uploads/event/%E4%B9%97%E9%99%8D%E5%8F%AF%E8%83%BD%E3%83%AA%E3%82%B9%E3%83%88%E8%8B%B1%E8%AA%9E%E7%89%88R050427.pdf\">program-approved sites</a>. The list includes shops, restaurants, museums, temples, hotels, and train stations, but notably (at the time of writing) is missing lacquerware and pottery sites. Planning an itinerary requires some type of map. The program has some cutesy printed tourist maps but it takes work to match sites to their anonymous map marker. The text spreadsheet of sites rarely matched to Google Maps' data. I took one afternoon to translate the spreadsheet into this Google map for public use: <a href=\"https://docs.google.com/spreadsheets/d/1bwseI89bdvTZtk2KPPKXKxjBsOn9ghALF9pYd_FRg1I/edit#gid=0\">spreadsheet</a>, <a href=\"https://www.google.com/maps/d/viewer?mid=1TtgIZJi_dbll7fYMhSUZ7Km23wcaXK8&amp;ll=35.95575194228227%2C136.17386385000003&amp;z=12\">google map</a>.\nBack to the taxi program...if paying by taximeter, Washi Village to Tafeku Station would be over 3000 yen! This is 500 yen per taxi, not per person. Using the taxi service requires you pre-planning your route because you <em>must purchase vouchers</em> at a tourist information center ahead of time. Taxi drivers seemed happy to participate. I did not have a working phone in Japan, and shopkeepers helped me call a taxi: they are well aware of the taxi program, so it did not require any explanation. Taxis arrived within 5-10 minutes of a call. One of my taxis was an old (but pristine) Nissan, which felt like tourism in and of itself to see.</li>\n<li>Walk<br>\nSome sites are very close together or close to the train station, in which case I just walked between them.</li>\n<li>Bus<br>\nInfrequent and, as far as I searched, geared toward locals and not tourism. Buses did not stop at or near main tourist sites.</li>\n</ol>\n<p>--</p>\n<p>I visited on a Monday. All day I saw &lt; 15 tourists and, except for me, they were all Japanese or spoke fluent Japanese.</p>\n<p>First, I needed lunch. On my way to the soba noodle restaurant, I wandered the &quot;downtown&quot;, which was quiet and pretty desolate. Some buildings were properly old, abandoned, and somewhat interesting to look at in contrast to Kyoto which was old, but actively-maintained and dense. The restaurant was in a properly old building and the vibes, food, and inner courtyard were excellent and left an impression, 10/10.</p>\n<p>I then took a taxi to the Knife Village. The location contains a little museum, store and the active workshop of a cooperative of knife makers. Makers were all men, and varied in age (many quite young! The craft is alive and well!). My favorite part was watching the craftsmen forge, pound out and polish their products. The store sells knives with more unique (prettyyyy) handles than I've ever seen. The museum was small, and low in information. I would have liked the opportunity to talk to an artisan, and have more information about the knives for sale and their qualities. Unfortunately (for a tourist) the knife shops around town are scattered, so the Knife Village is the most concentrated place to go. While overall I was pretty underwhelmed, I'd still recommend a quick stop if you're in Echizen.</p>\n<p>I really enjoyed the Washi Paper Village, which has a DIY workshop, professional workshop, shop and museum. I'd never seen paper making before. The highlight for me was watching a young craftwoman (26 y.o.) make washi paper and chatting with her about her life. At the Washi Paper and Culture Museum, I saw the artistic potential of washi paper and learned how printmaking with wood blocks works via a video that was offered in Japanese or English. The museum was small but I enjoyed it thoroughly. I have new respect for paper! Arrive before 2pm to have enough time to do everything.</p>\n<p>--</p>\n<p>When planning a trip to Echizen, here's my advice:</p>\n<ol>\n<li>\n<p>For crafts workshops, plan at least a month ahead. Some workshops require prior reservation. The soba workshop was booked out 1 week. Knife workshops are once in a while. The washi paper workshop (@Papyrus) is walk-in for individuals/small groups, but it closes at 4:30p (so arrive before 3pm).</p>\n</li>\n<li>\n<p>Get started early (9A, when businesses open). Craft businesses do close between 4-5pm, mindful of last entry time (30 min before close). If you, like me, prefer unhurried travel, consider visiting for 2 days.</p>\n</li>\n<li>\n<p>The taxi program is a fantastic deal for 1-4 travelers. The only downside was being locked into fixed locations. No stopping for cool looking things on the side of the road.</p>\n</li>\n<li>\n<p>Visit Monday, or W-F; craftspeople enjoy the weekend too and many sites close on Tuesday.</p>\n</li>\n</ol>\n","date_published":"Sat, 23 Sep 2023 23:10:10 GMT"},{"id":"http://localhost/posts/wn-nocameras/","url":"http://localhost/posts/wn-nocameras/","title":"Write a Twist (Writing Night)","content_html":"<blockquote>\n<p>Prompt: Write a story backwards that contains a plot twist</p>\n</blockquote>\n<h3 id=\"no-cameras\" tabindex=\"-1\"><a href=\"http://localhost/posts/wn-nocameras/#no-cameras\" class=\"header-anchor\">No Cameras</a></h3>\n<p>Two people sitting next to each other accidentally bump their forearms, and it’s sticky. Now this, but times 30.\nThe bus’s air conditioning has broken, and outside is a hot summer rain that fogs up the windows. People fan themselves and repeatedly glance at their watches with disappointment that more time hasn’t passed. A 6yo and an 8yo are draped over one another, learning the virtues of stillness and patience. This is not the summer vacation moment anyone hoped for. The tour guide gets up to announce arriving shortly, and that cameras are absolutely and strictly prohibited. The kids wipe the windows with their hands and peer out to see an open field with neat rows of figures. The 8yo squints and her attention is drawn in by one in particular. It’s bent over, as if getting up from the ground. The guide explains this is a memorial of statues honoring fallen soldiers. The bus halts at a stop sign. The 8 yo lifts her camera and finds the figure through the viewfinder. Shocked, she gasps and drops the camera. Once out of sight of the lens, the figure stops lifting its head.</p>\n<hr>\n<p>Every month my writing group convenes for 90 minutes. 30 mins of shooting the breeze, 30 mins of creative writing, and 30 minutes of sharing. This is the result.</p>\n","date_published":"Mon, 28 Aug 2023 10:10:10 GMT"},{"id":"http://localhost/posts/fringe-festival-planning/","url":"http://localhost/posts/fringe-festival-planning/","title":"How to Plan Your Fringe Festival Attendance","content_html":"<h3 id=\"i-upped-my-game\" tabindex=\"-1\"><a href=\"http://localhost/posts/fringe-festival-planning/#i-upped-my-game\" class=\"header-anchor\">I upped my game</a></h3>\n<p>Arts Festivals have overlapping events. Meanwhile information about shows, artists are often non-existant, limited, or obscure.</p>\n<p>Every year for 6 years, the Fringe Festival passed me by. I never got ahead of planning and by the time I heard word-of-mouth recommendations, tickets would be sold out.</p>\n<blockquote>\n<p><img src=\"http://localhost/media/fringeplan.png\" alt=\"A screenshot of my Fringe Planning spreadsheet, which you can use too!\"></p>\n</blockquote>\n<p>Last year, Year 7, I said no more! I massively upped my game for attending last year's Philly Fringe Festival and it's still paying off. I saw/participated in 13 events over the 5 weeks. My success rate was 77%, meaning I'd recommend them. And, I have developed a set of local artists whose work I see all year long.</p>\n<p>The 2023 Philly Fringe is coming September 7-24, and I offer you my planning spreadsheet and approach. Don't sleep on it! Your future self will thank you!</p>\n<!--more-->\n<h3 id=\"how-to-plan\" tabindex=\"-1\"><a href=\"http://localhost/posts/fringe-festival-planning/#how-to-plan\" class=\"header-anchor\">How to plan</a></h3>\n<ol>\n<li>\n<p>Pore over the catalog (1 hour)<br>\nThe month before the Fringe begins, get a copy of <a href=\"https://issuu.com/liveartsfestivalphillyfringe/docs/2022_guide_issuu_1_\">the festival catalog</a>. Free hard copies are well distrubuted at all kinds of local arts venues too. I prefer a hard copy where I can leave post-its and dog-ears. It was relaxing/fun to set aside a weekend morning to thumb through a magazine with some tea and mark everything that looked even a little interesting.</p>\n</li>\n<li>\n<p>Investigate and narrow list (time tbd)<br>\nGoogle your selected artists. Best case they will have an Instagram with some video snippets of past shows. Performance or artist blurbs are often very cryptic and don't provide much information. I want to see if I'm remotely attracted to their past work. I circled probably 30 shows, and narrowed it 50%.</p>\n</li>\n<li>\n<p>Attend Fringe Previews (optional)<br>\nThese shows are free but require reservation because of limited seating. I attended just one, but would go to more of them next time. I was exposed to shows I didn't necessarily mark in my catalog but then wanted to see. Plus, watching the preview put me in the mood to see more performance art! Doubled down.</p>\n</li>\n<li>\n<p>Make your time matrix <a href=\"https://docs.google.com/spreadsheets/d/1AxTNcH4MqjYwFkORWfv79udGpS1ZUjgMHyXquhZOvAU/edit#gid=0\">spreadsheet</a> (30 mins)<br>\nListing out all possible showtimes in a matrix makes it obvious when you can see each show. There's usually enough showtimes to make it work. If you've got a Fringe friend crew, you can cross check calendars.</p>\n</li>\n<li>\n<p>Buy your tickets online (10 mins)<br>\nShows definitely sell out. I like committing myself to the Fringe by buying my tickets early in bulk. This puts my laborious planning into motion and saves me from my future self who often tries to make excuses. Just do the thing and fogeddaboutit!</p>\n</li>\n</ol>\n<h3 id=\"lasting-impact\" tabindex=\"-1\"><a href=\"http://localhost/posts/fringe-festival-planning/#lasting-impact\" class=\"header-anchor\">Lasting Impact</a></h3>\n<p>For the rest of the year, I regularly saw performance art. The Fringe exposed me to local artists whose future shows I attended in Philly and virtually.</p>\n<p>In particular, I found out about artist Alexandra Tatarsky. By planning, I caught their early Fringe show that only had 3 viewings. I <em>loved</em> their absurdist solo act which I can best describe as <em>exploring the edges of what it means to be a clown</em>. I sheepishly introduced some friends to Tatarsky's future work, because how do you casually explain a 1-woman demonic jewish clown show? To my delight, their passion matched mine and one of my pals Talya even did this <a href=\"https://forward.com/culture/539519/holocaust-clown-show-alexandra-tatarsky-sad-boys-in-harpy-land/\">amazing interview with Tatarsky</a> for The Jewish Daily Forward, afterward. Spreading the love!</p>\n<p>If you're raring to nerd out on the Philly Fringe this year, don't be shy to hit me up to see some shows together!</p>\n","date_published":"Sat, 15 Jul 2023 10:10:10 GMT"},{"id":"http://localhost/posts/usb-problem/","url":"http://localhost/posts/usb-problem/","title":"If the USB fits, will it work?","content_html":"<h3 id=\"the-problem\" tabindex=\"-1\"><a href=\"http://localhost/posts/usb-problem/#the-problem\" class=\"header-anchor\">The Problem</a></h3>\n<p>While I was traveling recently, I encountered an interesting technical problem. As someone who likes to travel light, I consolidated all of my cords and plugs into the fewest types that in shape would work across all of my smaller devices. Specifically, I packed a USB C-C cord and a USB-C adapter plug. This was not necessarily the usual setup I had for each at home.</p>\n<p><img src=\"http://localhost/media/chargingdock.png\" alt=\"My multi-device charging dock\"></p>\n<!--more-->\n<p>During my layover, I tried to charge both my phone and my watch using my charging dock, which has a C port. To my surprise, I couldn't get any juice! I wondered if it was just the janky, wobbly airport outlet, but fortunately, a kind passenger lent me an A-C cord, which worked perfectly when plugged directly into an A outlet. Phew! I was able to charge my devices briefly before boarding the plane.</p>\n<p>But when I tried to use that same A-C cord on several seatback A ports on the plane, it didn't work at all. I was puzzled, but I just brushed it off as the outlets being fickle. After all, I was trapped on a plane, and there wasn't much I could do about it.</p>\n<p><img src=\"http://localhost/media/blocktoy.jpeg\" alt=\"A child and their block toy\"></p>\n<p>Up until now, I've always thought of USBs like a kid's block toy. If it fits, it should work, right? But the evidence was showing me that maybe it's not so simple.</p>\n<p>I had the impulse to throw the problem away and start fresh – I searched online to buy a new dock. However, I was pretty sure the dock itself was not broken since it worked well at the airport. I suspected this was a solvable technical problem. I removed the item from my cart.</p>\n<h3 id=\"isolating-the-problem\" tabindex=\"-1\"><a href=\"http://localhost/posts/usb-problem/#isolating-the-problem\" class=\"header-anchor\">Isolating the problem</a></h3>\n<p>First, I needed to verify that my tools were not broken. I tested the C-C cord and C adapter on my laptop, which charged successfully, although slowly. I confirmed that the cord and adapter were functional.</p>\n<p>Next, I needed to determine whether my dock had compatibility issues. I dug deep into my Amazon order history for the item listing. I checked the device documentation and specs and noticed that the dock came with an A-C cord and a 15W USB-A adapter. These are what I used at home without issue until the day before.</p>\n<p>I double-checked the C adapter output and saw that it was ~15W.</p>\n<p>So each component was functioning and appropriate, just not together for some reason.</p>\n<h3 id=\"a-brief-deep-dive-into-usbs\" tabindex=\"-1\"><a href=\"http://localhost/posts/usb-problem/#a-brief-deep-dive-into-usbs\" class=\"header-anchor\">A Brief Deep Dive into USBs</a></h3>\n<p>The Universal Serial Bus (USB) was created collaboratively by major computer companies to standardize connecting peripheral devices to a computer. <a href=\"https://www.eetimes.com/do-you-remember-the-world-before-usb/\">Before USB</a>, there were too many options of connectors that peripheral devices could use, and some required manual configuration on the computer. This was especially cumbersome for end-users like you and me.</p>\n<p>Nowadays (in 2023), there are many types of USBs available. The most popular ones are A and C. Additionally, there are B and micro versions of A, B for the smallest single-board computers like Raspberry Pis and Arduinos. The standards governing body for USBs, the <a href=\"https://www.usb.org/\">USB-IF</a>, upgrades the USB build specification over time. As of 2019, the version is 4.0.</p>\n<p>Newer versions are speedier (in terms of data transfer and charging) by using more modern hardware and/or adding pins, but all versions remain usable. I should note to myself to consider replacing my USB cords with those supplied with newly purchased devices.</p>\n<p>While the USB's wide adoption by device manufacturers changed the game for consumers to &quot;plug and play&quot;, it turns out that not all USBs are made equal. While USBs have a specification, manufacturers can interpret it differently. Additionally, there is no product compliance body that quality checks if USBs are made equally. This can lead to behavioral inconsistency and the ability to cut corners in the hardware.</p>\n<p>USB-C is on track to become the standard USB type. In 2022, the <a href=\"https://www.macrumors.com/2022/10/24/eu-gives-final-approval-to-usb-c-law/\">E.U famously passed a law</a> mandating companies (such as Apple) to switch to USB-C on technically-compatible devices starting in 2024.</p>\n<p>Power can flow either way between devices connected via USB-C, with the important caveat that the devices themselves must decide which will act as either the power source or sink. This is a crucial communication step that is largely automatic via the USB hardware and relative level of device charge (if both devices have batteries). On <a href=\"https://qr.ae/pyG0ZH\">some devices</a>, the direction of power flow can be chosen by the user. For USB-A, power flow is automatic and unidirectional from the A male plug as part of the spec.</p>\n<p>In the case of my charging dock, I noticed that no power was drawn when using the C-only setup. Charging was successful using an A-C cord direct to socket. My dock was cheaply manufactured and was supplied with an A-C cord, so I suspect that it lacks the C hardware that declares itself the power sink. An electronics hobbyist on Reddit reported solving this with a simple solder job: soldering 5.1k resistor pulldowns onto both pins labelled &quot;CC&quot; on the C female port of his sink device (in my case, the charging dock). This fix was corroborated by descriptions of USB-C <a href=\"https://www.aliexpress.com/item/1005004848158786.html\">boards for sale</a>.</p>\n<h3 id=\"resolution\" tabindex=\"-1\"><a href=\"http://localhost/posts/usb-problem/#resolution\" class=\"header-anchor\">Resolution</a></h3>\n<p><img src=\"http://localhost/media/usbsolution.png\" alt=\"As my solution, I purchased an A-C cord and A-C female to male adapter\"></p>\n<p>I went to the store and walked away with an A-C cord and an A-C female to male adapter. This way, I could still use my C adapter plug. Now my devices are charging perfectly, so I'm happy with my solution.</p>\n<p>The only mystery left unsolved is why my devices didn't charge on the plane. I think it might have been due to low voltage, but I don't have enough data to support this hypothesis.</p>\n<p>I find communication fascinating in all its forms: between people, between the brain and body, among animals, and, in this case, among technology. I’m glad to have gained this new understanding of an otherwise invisible part of our daily lives.</p>\n","date_published":"Mon, 08 May 2023 10:10:10 GMT"},{"id":"http://localhost/posts/wn-broadstreetrun-noadj/","url":"http://localhost/posts/wn-broadstreetrun-noadj/","title":"The Broad Street Run (Writing Night)","content_html":"<blockquote>\n<p>Prompt: Write in short clear sentences and avoid using adjectives/adverbs</p>\n</blockquote>\n<h3 id=\"the-broad-street-run\" tabindex=\"-1\"><a href=\"http://localhost/posts/wn-broadstreetrun-noadj/#the-broad-street-run\" class=\"header-anchor\">The Broad Street Run</a></h3>\n<p>Jenny waited for the train to Olney Station.<br>\nShe wore sneakers, tights, and a trash bag.<br>\nSome people on the train also wore sneakers and tights.<br>\nOther people wore shorts.<br>\n“Are you Neta’s Mom? I thought so! Patrick is in her class. I was in your house, once.”<br>\nPeople looked at their watches.<br>\n“When the train arrives, start running,” someone said.<br>\nAfter 10 minutes, the train restarted.<br>\n“Yay,” the crowd groaned.<br>\nBalloons spelled “BROAD STREET RUN” on the Olney platform.<br>\nJenny followed the crowd to the corral.<br>\nIt was not yet raining.<br>\nThe Rocky Theme song played from a loudspeaker.<br>\nJenny danced briefly.<br>\nThe crowd started to run, so Jenny started to run.<br>\nSome neighborhood residents cheered and watched from their porches.<br>\nSome DJs and Emcees set up booths along the way.<br>\n“I like them shoes!”<br>\nAfter 2 miles, it started to rain.<br>\nIt rained for 8 miles.<br>\nJenny glanced down only to avoid puddles.<br>\nHer concentration broke when hearing the Temple University marching band.<br>\nIt rained on the band.<br>\nHer concentration broke again when hearing “You Can Call Me Al” on Church speakers.<br>\nIt rained on the Church members.<br>\nA neighbor held a big sign: “Slap this sign if you have to poop”.<br>\nJenny slapped the sign, but did not have to poop.<br>\n“If my concentration is broken for these reasons, I can’t be mad,” she smiled.<br>\nAt mile 9, Jenny thought, “You are nothing if not a strong finisher” and sped up.</p>\n<hr>\n<p>Every month my writing group convenes for 90 minutes. 30 mins of shooting the breeze, 30 mins of creative writing, and 30 minutes of sharing. This is the unedited result.</p>\n","date_published":"Mon, 01 May 2023 10:10:10 GMT"},{"id":"http://localhost/posts/wn-ipayandileave/","url":"http://localhost/posts/wn-ipayandileave/","title":"I pay, and leave (Writing Night)","content_html":"<blockquote>\n<p>Prompt: Write a complete story where the final sentence is “I pay, and leave.”</p>\n</blockquote>\n<h3 id=\"nancy-in-the-afternoon\" tabindex=\"-1\"><a href=\"http://localhost/posts/wn-ipayandileave/#nancy-in-the-afternoon\" class=\"header-anchor\">Nancy In the Afternoon</a></h3>\n<p>I sit and the cracked leather upholstery scratches the bottom skin of my thighs as I shift around. It’s things like this that make an old broad like me feel at home here. I came to hear the hum of people, and have something else to do besides watch TV at home. By now the paper coaster under my 3rd glass has begun to peel. I don’t look around too much because I’m not trying to attract attention. Keep my eyes down or forward at the bar. The bar is dusty and the bottles are organized like a library – by color, size, within each liquor category, except tonight’s bartender is a bit sloppy and not putting them back right. The end of the shelves has amateur taxidermy of small critters: birds and rodents. They are real funny looking things, with their eyes and teeth a little too sunken or out of place. But their bodies look exactly like you’d think. I wonder how old they were when they y’know, and I wonder why animals when they age keep nearly the same shape. Lord knows humans don’t have that fortune – like me, these days I’m no longer round enough in the preferred places and plenty round in the rest. The abrupt change of song at the ancient jukebox brings me back and I look over at the wall clock. It’s about time for dinner. Ungluing my thighs from the seat one-by-one, I pay, and leave.</p>\n<hr>\n<p>Every month my writing group convenes for 90 minutes. 30 mins of shooting the breeze, 30 mins of creative writing, and 30 minutes of sharing. This is the unedited result.</p>\n","date_published":"Mon, 01 May 2023 10:10:10 GMT"}]}